TexasInstruments/c2000ware-core-sdk/driverlib/f2838x/examples/c28x/sci/baud_tune_via_uart.syscfg
/**
 * Import the modules used in this configuration.
 */
var sci = scripting.addModule("/driverlib/sci.js", {}, false);
var sci1 = sci.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
sci1.$name = "mySCI0";
sci1.baudRates = 9600;
sci1.sci.$name = "MySCI1";
sci1.sci.sci_rxPin.$assign = "GPIO9";
sci1.sci.sci_txPin.$assign = "GPIO8";